In [1]:
import pandas as pd

In [29]:
df=pd.read_csv('titanic1.csv')

In [30]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

# Dropping some of the features

In [4]:
df.columns

Index(['PassengerId', 'Name', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [31]:
df.drop(['PassengerId', 'Name','SibSp', 'Parch','Ticket','Cabin', 'Embarked'],axis=1,inplace=True)

In [32]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

# Separating Target variable

In [33]:
target=df.Survived

In [34]:
inputs=df.drop('Survived',axis=1)

In [35]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

# One Hot Encoding

In [36]:
inputs=pd.get_dummies(inputs,drop_first=True)

In [37]:
inputs.head()

   Pclass   Age     Fare  Sex_male
0       3  22.0   7.2500         1
1       1  38.0  71.2833         0
2       3  26.0   7.9250         0
3       1  35.0  53.1000         0
4       3  35.0   8.0500         1

# Removing Null values in Age

In [38]:
inputs.isnull().sum()

Pclass        0
Age         177
Fare          0
Sex_male      0
dtype: int64

In [39]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())

In [40]:
inputs.head()

   Pclass   Age     Fare  Sex_male
0       3  22.0   7.2500         1
1       1  38.0  71.2833         0
2       3  26.0   7.9250         0
3       1  35.0  53.1000         0
4       3  35.0   8.0500         1

In [41]:
inputs.isnull().sum()

Pclass      0
Age         0
Fare        0
Sex_male    0
dtype: int64

# Train Test Split

In [43]:
from sklearn.model_selection import train_test_split

In [44]:
x_train, x_test, y_train, y_test=train_test_split(inputs,target,test_size=0.2)

In [45]:
len(x_train)

712

In [46]:
len(x_test)

179

# Naive Bayes Algorithm

In [47]:
from sklearn.naive_bayes import GaussianNB

In [48]:
model=GaussianNB()

In [49]:
model.fit(x_train,y_train)

GaussianNB()

In [50]:
model.score(x_test,y_test)

0.7486033519553073

In [51]:
model.predict(x_test[:10])

array([1, 0, 0, 1, 0, 0, 1, 1, 1, 1], dtype=int64)

In [52]:
y_test[:10]

56     1
793    0
749    0
486    1
16     0
637    0
610    0
698    0
297    0
816    0
Name: Survived, dtype: int64

In [54]:
model.predict_proba(x_test[:10])

array([[1.72759153e-01, 8.27240847e-01],
       [7.53726809e-01, 2.46273191e-01],
       [9.68466953e-01, 3.15330471e-02],
       [7.67764992e-03, 9.92322350e-01],
       [9.32152352e-01, 6.78476475e-02],
       [9.25870205e-01, 7.41297954e-02],
       [3.50029767e-01, 6.49970233e-01],
       [9.76099960e-02, 9.02390004e-01],
       [2.81557437e-05, 9.99971844e-01],
       [3.36281248e-01, 6.63718752e-01]])